{
  "architectures": [
    "AutoModelForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_qwen2.Qwen2Config",
    "AutoModelForCausalLM": "modeling_qwen2.Qwen2ForCausalLM"
  },
  "model_type": "qwen2",
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "emb_pdrop": 0.0,
  "embedding_dim": 1536,
  "embedding_length_range": null,
  "ff_dim_multiplier": null,
  "hidden_act": "silu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1536,
  "initializer_range": 0.02,
  "intermediate_size": 8960,
  "kv_channels": 128,
  "max_position_embeddings": 32768,
  "max_window_layers": 28,
  "num_attention_heads": 12,
  "num_hidden_layers": 28,
  "num_key_value_heads": 2,
  "scale_attn_weights": true,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "use_sliding_window": false,
  "vocab_size": 152064,
  "transformers_version": "4.40.0",
  "torch_dtype": "float32"
}
